In [19]:
import pandas as pd
import numpy as np

df_business = pd.read_csv('dataset/business_fixed.csv', engine="python")
df_eco = pd.read_csv('dataset/economy_fixed.csv', engine="python")

In [20]:
df_business.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612"
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612"
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...,20:45,Mumbai,"42,220"
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...,23:55,Mumbai,"44,450"
4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...,23:55,Mumbai,"46,690"

In [21]:
df_business = df_business.map(lambda x: x.strip() if isinstance(x, str) else x)

df_business = df_business.map(lambda x: " ".join(x.split()) if isinstance(x, str) else x)

df_business.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612"
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612"
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop,20:45,Mumbai,"42,220"
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop,23:55,Mumbai,"44,450"
4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop,23:55,Mumbai,"46,690"

In [22]:
df_eco = df_eco.map(lambda x: x.strip() if isinstance(x, str) else x)

df_eco = df_eco.map(lambda x: " ".join(x.split()) if isinstance(x, str) else x)

df_eco.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953"
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953"
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956"
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955"
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955"

In [23]:
df_business['business'] = 1
df_business.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,business
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612",1
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612",1
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop,20:45,Mumbai,"42,220",1
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop,23:55,Mumbai,"44,450",1
4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop,23:55,Mumbai,"46,690",1

In [24]:
df_eco['business'] = 0
df_eco.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,business
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953",0
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953",0
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956",0
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955",0
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955",0

In [25]:
df = pd.concat([df_business, df_eco], ignore_index=True)
df.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,business
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612",1
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612",1
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop,20:45,Mumbai,"42,220",1
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop,23:55,Mumbai,"44,450",1
4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop,23:55,Mumbai,"46,690",1

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300261 entries, 0 to 300260
Data columns (total 12 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        300261 non-null  object
 1   airline     300261 non-null  object
 2   ch_code     300261 non-null  object
 3   num_code    300261 non-null  int64
 4   dep_time    300261 non-null  object
 5   from        300261 non-null  object
 6   time_taken  300261 non-null  object
 7   stop        300261 non-null  object
 8   arr_time    300261 non-null  object
 9   to          300261 non-null  object
 10  price       300261 non-null  object
 11  business    300261 non-null  int64
dtypes: int64(2), object(10)
memory usage: 27.5+ MB

In [27]:
df['airline'].unique()

array(['Air India', 'Vistara', 'SpiceJet', 'AirAsia', 'GO FIRST',
       'Indigo', 'Trujet', 'StarAir'], dtype=object)

In [28]:
df['stop'].unique()

array(['non-stop', '1-stop', '1-stop Via IDR', '1-stop Via IXU',
       '1-stop Via Chennai', '1-stop Via Lucknow', '1-stop Via STV',
       '1-stop Via Hyderabad', '1-stop Via GAY', '2+-stop',
       '1-stop Via Guwahati', '1-stop Via GAU', '1-stop Via VTZ',
       '1-stop Via NDC', '1-stop Via IXE', '1-stop Via Raipur',
       '1-stop Via PAT', '1-stop Via RPR', '1-stop Via Patna',
       '1-stop Via Kolkata', '1-stop Via HYD', '1-stop Via Delhi',
       '1-stop Via Bhubaneswar', '1-stop Via BBI', '1-stop Via Surat',
       '1-stop Via Indore', '1-stop Via GOP', '1-stop Via Nagpur',
       '1-stop Via NAG', '1-stop Via Vishakhapatnam',
       '1-stop Via Mangalore', '1-stop Via Mumbai', '1-stop Via KLH',
       '1-stop Via MYQ', '1-stop Via Kolhapur', '1-stop Via JRG',
       '1-stop Via Ranchi', '1-stop Via IXR', '1-stop Via JGB',
       '1-stop Via Mysore'], dtype=object)

In [29]:
df["price"] = df["price"].str.replace(",", "", regex=True).astype(int)

In [30]:
df.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,business
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,25612,1
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,25612,1
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop,20:45,Mumbai,42220,1
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop,23:55,Mumbai,44450,1
4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop,23:55,Mumbai,46690,1

In [31]:
df.describe()

            num_code          price       business
count  300261.000000  300261.000000  300261.000000
mean     1417.771709   20883.717666       0.311352
std      1974.514439   22695.911266       0.463047
min       101.000000    1105.000000       0.000000
25%       637.000000    4783.000000       0.000000
50%       818.000000    7425.000000       0.000000
75%       927.000000   42521.000000       1.000000
max      9991.000000  123071.000000       1.000000

In [32]:
df["date"] = pd.to_datetime(df["date"], dayfirst=True)
df["day"] = df["date"].dt.day
df["month"] = df["date"].dt.month
df["day_of_week"] = df["date"].dt.dayofweek
df.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,business,day,month,day_of_week
0,2022-02-11,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,25612,1,11,2,4
1,2022-02-11,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,25612,1,11,2,4
2,2022-02-11,Air India,AI,531,20:00,Delhi,24h 45m,1-stop,20:45,Mumbai,42220,1,11,2,4
3,2022-02-11,Air India,AI,839,21:25,Delhi,26h 30m,1-stop,23:55,Mumbai,44450,1,11,2,4
4,2022-02-11,Air India,AI,544,17:15,Delhi,06h 40m,1-stop,23:55,Mumbai,46690,1,11,2,4